{
  "header": {
    "name": "Yasin Efe",
    "title": "Lead Software Engineer",
    "type": "Contractor",
    "email": "yasinefe@gmail.com",
    "mobile": "* **** ****",
    "linkedin": "linkedin.com/in/yasinefe",
    "github": "github.com/yasinefe"
  },
  "profile": {
    "title": "PROFILE",
    "expanded": true,
    "items": [
      "Excellent knowledge and <b>more than 15 years</b> hands-on experience in all phases of <b>back-end application/service</b> development, using <b>Java and Spring Framework</b>. Highly skilled in implementing <b>Scalable & High Available</b> application and microservices. Experience of designing interfaces with <b>REST APIs</b> and <b>Web Services</b>. Strong understanding of applying <b>Agile and Extreme Programming</b>, Test Driven Development <b>(TDD)</b> and Behaviour Driven Development <b>(BDD)</b>, Continuous Integration <b>(CI)</b> and Delivery <b>(CD)</b>, <b>Pair Programming</b> to deliver well designed and tested applications and services.",
      "Passionate about using new technologies and applying them to real world problems. Interested in <b>Computer Mathematics, Algorithms, Artificial Intelligence, Machine Learning</b> and <b>Deep Learning</b>."
    ]
  },
  "technicalSkills": {
    "title": "TECHNICAL SKILLS",
    "expanded": true,
    "items": [
      {
        "name": "Languages",
        "expanded": true,
        "items": [
          "Java 11",
          "Groovy",
          "Python",
          "Kotlin",
          "Node JS",
          "OOP",
          "Functional Programming",
          "Reactive Programming",
          "Design Patterns"
        ]
      },
      {
        "name": "Frameworks",
        "expanded": true,
        "items": [
          "Spring Framework (Core, MVC, WebFlux, JDBC, AOP, JaxWS, REST, Cache, Transaction Management, Security, JPA, JMS and Hibernate Support)",
          "Spring Boot",
          "Akka (Actors, Streams, FSM, Persistence, Cluster, Distributed Data)",
          "Project Reactor",
          "Apache Camel",
          "JMX",
          "JPA",
          "Hibernate",
          "Maven",
          "Gradle",
          "NPM"
        ]
      },
      {
        "name": "Queues",
        "expanded": true,
        "items": [
          "Active MQ",
          "Rabbit MQ",
          "Kafka"
        ]
      },
      {
        "name": "Web Frameworks",
        "expanded": true,
        "items": [
          "React JS",
          "Angular",
          "HTML",
          "Java Script",
          "CSS",
          "Material UI",
          "Bootstrap",
          "GraphQL"
        ]
      },
      {
        "name": "Processes",
        "expanded": true,
        "items": [
          "Agile & Extreme Programming",
          "Scrum",
          "Kanban",
          "Continuous Integration (CI)",
          "Continuous Delivery (CD)",
          "GitLab Pipelines",
          "Jenkins",
          "Bamboo",
          "Concourse",
          "Code Review",
          "Pair Programming"
        ]
      },
      {
        "name": "Test Driven Development (TDD)",
        "expanded": true,
        "items": [
          "JUnit",
          "Mockito",
          "EasyMock",
          "Scala Test",
          "Kotlin Test"
        ]
      },
      {
        "name": "Behaviour Driven Development (BDD)",
        "expanded": true,
        "items": [
          "Cucumber",
          "JBehave",
          "Spock",
          "Geb and Wiremock"
        ]
      },
      {
        "name": "Protocols",
        "expanded": true,
        "items": [
          "REST Services (JSON and XML)",
          "Web Services",
          "SOAP",
          "HTTP/S",
          "TCP",
          "FTP",
          "SNMP",
          "SMPP",
          "SS7",
          "TLS"
        ]
      },
      {
        "name": "Cloud & Container",
        "expanded": true,
        "items": [
          "Cloud Foundry",
          "PCF",
          "AWS",
          "Docker",
          "Kubernetes",
          "Google Cloud Platform (GCP)",
          "Azure"
        ]
      },
      {
        "name": "Tools",
        "expanded": true,
        "items": [
          "IntelliJ Idea",
          "XCode",
          "Eclipse",
          "Jira",
          "Nexus",
          "Jacoco",
          "Git (GitHub, GitLab)",
          "Terraform, Helm",
          "Kibana",
          "Prometheus",
          "Apigee"
        ]
      },
      {
        "name": "Databases",
        "expanded": true,
        "items": [
          "Oracle",
          "PL-SQL",
          "My SQL",
          "HSQL",
          "MongoDB",
          "Elastic Search",
          "Cosmos DB"
        ]
      },
      {
        "name": "Application Servers",
        "expanded": true,
        "items": [
          "Apache Server",
          "Tomcat",
          "Jetty",
          "OC4J",
          "JBoss"
        ]
      },
      {
        "name": "Operating Systems",
        "expanded": true,
        "items": [
          "Linux",
          "Solaris",
          "Shell/Bash Script"
        ]
      }
    ]
  },
  "careerHistory": {
    "title": "CAREER HISTORY",
    "expanded": true,
    "items": [
      {
        "expanded": true,
        "company": "UBS",
        "period": "2019/11 – Present",
        "title": "Lead Java Developer – Contractor",
        "logo": "/static/images/ubs.png",
        "items": [
          "Designed and developed microservices using <b>Java 8</b>, <b>Spring Boot</b> exposing <b>REST</b> APIs for external & internal clients.",
          "Integrated microservices using <b>Kafka</b> and <b>Kafka Streams</b>, with <b>Avro Schema</b> and <b>Schema Registry</b>.",
          "Created a user interface to visualise complex data flow through microservices using <b>React JS</b> and <b>Material UI</>.",
          "Implemented <b>REST</b> APIs using <b>JWT</b> authentication and developed authorization service using <b>HSM</b> for external clients.",
          "Defined and built infrastructure on <b>Azure</b> and <b>Cosmos DB</b> using <b>Infrastructure as Code</b> approach with <b>Terraform</b>.",
          "<b>Other technologies used:</b> Lombok, Jira, IntelliJ, Cucumber, Mockito, Spring JPA, Maven, TeamCity, Jacoco, GitHub, OpenAPI."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>GED (Global Equity Derivatives) - Microservices:</b> Provides trading services for Client Facing Sales and Trading platform."
        ]
      },
      {
        "expanded": true,
        "company": "Mastercard",
        "period": "2018/07 – 2019/11 (1y 5m)",
        "title": "Lead Java Developer – Contractor",
        "logo": "/static/images/mastercard.png",
        "items": [
          "Developed microservices using <b>Java 11</b>, <b>Kotlin</b>, <b>Spring Boot</b>, <b>Akka</b> backed with <b>Casandra</b>, <b>VoltDB</b> and <b>Oracle DB</b>.",
          "Integrated microservices using <b>Kafka</b>, <b>Akka</b> (<b>Streams</b>, <b>Http</b>, <b>Persistence</b>, <b>Cluster</b> and <b>Distributed Data</b>), <b>REST</b>.",
          "Built infrastructure on <b>GCP</b> (Google Cloud Platform) using <b>Infrastructure as Code</b> approach with <b>Terraform</b>.",
          "Worked in agile environment, developed microservices <b>TDD</b>, <b>BDD</b>, fully automated <b>CI</b> and <b>CD</b>.",
          "Containerised and deployed microservices using <b>Docker</b>, <b>Kubernetes</b>, <b>Helm</b> on <b>GCP</b>.",
          "Designed and created <b>highly available</b>, <b>low latency</b> services to support <b>10K</b> transaction per second.",
          "Integrated microservices with <b>EFK</b> (Elastic Search, FluentD, Kibana) for log monitoring and tracing.",
          "Designed to provide highly secure payment system which will be deployed on <b>Critical National Infrastructure</b> of a country.",
          "<b>Other technologies used:</b> Flyway, Lombok, Jira, IntelliJ, Cucumber, Mockito, Spring JPA, Kotlin Test, Gradle, Maven, SonarQube, Snyk, Jacoco, PI Test, GitLab and GitLab Pipelines."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>IPSX – Microservices:</b> Next-Gen Instant Payment System (real time payment processor) developed with Java 11 and Akka."
        ]
      },
      {
        "expanded": true,
        "company": "HSBC",
        "period": "2017/04 – 2018/06 (1y 3m)",
        "title": "Senior Java Developer – Contractor",
        "logo": "/static/images/hsbc.png",
        "items": [
          "Developed and integrated operable microservices using <b>Java 8</b>, <b>Spring Boot</b> backed with <b>MongoDB</b>.",
          "Integrated microservices with <b>Spring Cloud Config</b> to centralise and make config changes without interruption.",
          "Implemented <b>GraphQL</b> based API to provide flexible, performant and client centric endpoint.",
          "Provided reactive APIs using <b>Reactive Programming</b> with Java Reactor library and spring mvc reactor support.",
          "Used <b>PCF</b> (Pivotal Cloud Foundry) to deploy, scale and maintain multiple environments for microservices.",
          "Integrated microservices with <b>Splunk</b> to monitor services and trace transactions for different environments.",
          "Worked in agile environment, developed microservices with <b>TDD</b>, <b>BDD</b>, <b>CI</b> and <b>CD</b>.",
          "<b>Other technologies used:</b> Splunk, Jira, IntelliJ, Swagger, Cucumber, Mockito."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>TED – Microservices:</b> Provides GraphQL and REST APIs for a tablet application, used by staff in HSBC branches."
        ]
      },
      {
        "expanded": true,
        "company": "Marks & Spencer",
        "period": "2016/07 – 2017/03 (9m)",
        "title": "Lead & Senior Java Developer - Contractor",
        "logo": "/static/images/mns.jpeg",
        "items": [
          "<b>Mentored</b> and <b>guided</b> team members to improve their technical skills focusing on <b>TDD</b>, <b>Agile</b> and <b>CI</b> / <b>CD</b>.",
          "Developed microservices which expose <b>REST</b> interfaces using <b>Java 8</b> and <b>Spring Boot</b>.",
          "Used <b>AWS</b>, <b>Cloud Foundry</b> and <b>Docker</b> to deploy microservices, such as Product, Price, Category etc.",
          "Built <b>AWS</b> infrastructure using <b>Terraform</b> such as VPC, Subnet, EC2, RDS, S3, Routing, Volumes, Lambda, etc.",
          "Worked in <b>Agile</b> environment using <b>Scrum</b> and <b>Kanban</b> with <b>TDD</b> (Mockito), <b>BDD</b> and <b>Pair Programming</b>.",
          "Created pipeline to build, release, deploy and deliver microservices using <b>Concourse CI</b> and <b>CD</b> tool.",
          "Designed and created operable and maintainable microservices using <b>Pingdom</b>, <b>Loggly</b> and <b>Log Entries</b> tool.",
          "Used <b>RabbitMQ</b> and <b>Kafka</b> to retrieve and store xml data exported from SAP system.",
          "<b>Other technologies used:</b> Apigee, Terragrunt, Trello, Jira, IntelliJ, Node JS, Swagger."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>Product Services – Microservices:</b> Provides REST APIs for mns.com and mobile app to sell products online.",
          "<b>Price Services – Microservices:</b> Provides REST APIs for third parties and customer services."
        ]
      },
      {
        "expanded": true,
        "company": "Sky",
        "period": "2014/10 – 2016/06 (1y 9m)",
        "title": "Senior Java Developer - Contractor",
        "logo": "/static/images/sky.png",
        "items": [
          "Developed microservices which expose <b>HAL</b> and <b>HATEOAS</b> based <b>REST</b> interfaces using <b>Java</b> and <b>Python</b>.",
          "Used <b>Spring Boot</b>, <b>Groovy</b> to provide APIs designed as <b>microservices</b> for Single Sign On project (SkyID).",
          "Implemented <b>Single Sign On</b> APIs for authentication and authorisation using <b>OAuth 2</b> specification.",
          "Worked in pure <b>Agile</b> process with <b>TDD</b>, <b>BDD</b> (Spock and Cucumber) and <b>Pair Programming</b>.",
          "Experienced using <b>Gradle</b> and <b>Jenkins</b> for continuous integration and fully automated deployment process.",
          "Implemented database requirements using <b>Cassandra DB</b> and <b>Memcached</b> for the applications.",
          "Used <b>Nimbus</b> cloud system (<b>Cloud Foundry</b>) to deploy and run the applications on different environments.",
          "Used GIT with <b>branch</b> per feature and <b>workflow</b> approaches to manage sources.",
          "<b>Other technologies used:</b> IntelliJ, Nexus, Tomcat, Unix, JUnit, Mockito."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>PSP – Product Sales Channel – Microservices:</b> Provides REST APIs to allow Sky customers to buy Sky products online.",
          "<b>SkyID – Microservices:</b> Provides HATEOAS based REST APIs to allow Sky customers to manage their sky account."
        ]
      },
      {
        "expanded": true,
        "company": "Salmon",
        "period": "2013/08 – 2014/09 (1y 2m)",
        "title": "Senior Java Developer - Contractor",
        "logo": "/static/images/salmon.png",
        "items": [
          "Developed several back-end applications using <b>J2EE</b>, <b>Design Patterns</b>, <b>OOP</b> and <b>Spring Framework</b>.",
          "Established an effective solution to change existing <b>SOAP</b> web services to <b>REST (JSON)</b> using <b>Spring MVC</b>.",
          "Used <b>Spring Security</b> with session based and <b>HTTP Basic</b> authentication to provide secure REST web services.",
          "Customized and configured <b>Spring Security</b> to provide highly secure REST web services with encryption.",
          "Solved all <b>cross-domain</b> problems faced on front end, implemented client and back-end solutions.",
          "Developed applications using <b>Test Driven Development</b> (TDD) with <b>JUnit</b> and <b>Mockito</b>.",
          "<b>Other technologies used:</b> Maven, JMS, Active MQ, JSP, HTML, JavaScript, CSS, AJAX, JQuery, Pair Programming, Eclipse, Archiva, Cobertura, SVN, SOAP UI, Selenium, My SQL, Tomcat, Apache Server and Unix."
        ],
        "projectTitle": "Projects",
        "projectItems": [
          "<b>MyAudi – Microservices:</b> Provides more than 100 secure and non-secure REST services using ESB and SOA architecture.",
          "<b>AUDI Product DB Services:</b> Manages all data for Audi cars and related products, exposes 50 WS interfaces for clients.",
          "<b>AUDI Web Services:</b> Provides REST interfaces for front end forms in Audi.co.uk and Audi mobile applications."
        ]
      },
      {
        "expanded": false,
        "company": "Vodafone",
        "period": "2009/12 – 2013/06 (3y 7m)",
        "title": "Lead & Senior Java Developer",
        "logo": "/static/images/vodafone.png",
        "items": [
          "Designed and developed various enterprise back-end applications using <b>Java</b>, <b>J2EE</b> and <b>Spring Framework</b>.",
          "Used many modules of <b>Spring Framework</b> such as JDBC, Hibernate, Transaction, AOP, JaxWS, MVC, Cache.",
          "Developed numerous web applications using <b>Spring MVC</b>, JSP, HTML, JavaScript, JQuery, CSS and AJAX.",
          "Researched and implemented <b>MapReduce</b> functions to query users in a specific location using Hadoop, HDFS.",
          "Refactored existing applications using <b>OOP</b>, <b>Design Patterns</b> and <b>SOLID</b> principles.",
          "Defined required interfaces and implemented them for n-tier systems using <b>SOAP</b> and <b>REST</b> (<b>JSON</b> and <b>XML</b>).",
          "Developed a number of <b>web services</b> using Spring MVC, JaxWS, Axis, Spring Security and WSS.",
          "Implemented several <b>scalable</b>, <b>highly available</b> and <b>multi-threaded</b> applications which run in <b>low latency</b>.",
          "Integrated projects with <b>Continuous Integration</b> tool (Bamboo), and configured it to be used more efficiently.",
          "Implemented requirements using <b>TDD</b> with JUnit, Mockito, Easy Mock and <b>BDD</b> with JBehave, Spock and GEB.",
          "Designed and developed a reusable application to keep web services <b>backward compatible</b> using <b>Groovy</b>.",
          "Created functional tests using <b>Groovy</b>, led the test team to use Groovy for acceptance tests.",
          "Used a number of protocols such as <b>HTTP</b>, <b>TCP</b>, <b>FTP</b>, <b>JMX</b>, <b>JMS</b> and <b>SNMP</b> to develop integrated applications.",
          "Defined database models for various applications, and used <b>ORM</b> tools, such as <b>Hibernate</b>, <b>JPA</b>.",
          "Researched <b>Enterprise Service Bus</b> solutions, to provide <b>authorization</b>, <b>throttling</b> and <b>routing</b> functionalities.",
          "Performed <b>load testing</b> using JMeter and SOAP UI, provided solutions for performance related issues.",
          "<b>Other technologies used:</b> Maven, Eclipse, Toad, Jira, Nexus, Archiva, Clover, Sonar, Crucible, Cobertura, Jira Agile, CVS, SVN, Oracle, PL-SQL, Tomcat, Jetty, Unix and Solaris."
        ]
      },
      {
        "expanded": false,
        "company": "BNP Paribas",
        "period": "2008/04 – 2009/11 (1y 8m)",
        "title": "Senior Java Developer",
        "logo": "/static/images/bnp.png",
        "items": [
          "Led a development team to create an <b>online banking</b> application using <b>Java</b>, <b>Spring Framework</b> and <b>Struts</b>.",
          "Developed a <b>web application</b> with French colleagues in a multinational environment using internationalisation.",
          "Researched a number of <b>rich client</b> solutions such as <b>ExtJS</b>, <b>JQuery</b>, <b>Backbone</b>, and created prototypes.",
          "Developed a rich client web application using <b>JSP</b>, <b>HTML</b>, <b>JavaScript</b>, <b>JQuery</b>, <b>CSS</b>, <b>AJAX</b> and <b>JSTL</b>.",
          "Found a specific solution for each performance issue of a <b>Single Page Application</b> (SPA) and increased quality.",
          "<b>Other technologies used:</b> Design Patterns, OOP, Spring Framework (Core, JDBC Dao Support, Cache, Transaction Management), Web Service, SOAP, HTTP, Toad, Clear Case, RSA, Selenium Web Drivers, Oracle, PL-SQL, OC4J, Web Sphere and Unix."
        ]
      },
      {
        "expanded": false,
        "company": "Vodafone",
        "period": "2005/04 – 2008/03 (3y)",
        "title": "Java Developer",
        "logo": "/static/images/vodafone.png",
        "items": [
          "Designed and developed a number of back-end applications using <b>Java</b>, <b>J2EE</b> and <b>Spring Framework</b>.",
          "Developed several web applications using <b>Spring MVC</b>, <b>Struts</b>, JSP, HTML, JQuery, CSS and AJAX.",
          "Redesigned and refactored existing applications using <b>OOP Design Patterns</b> and <b>SOLID</b> principles.",
          "Developed many applications, which expose <b>SOAP</b> web services using Spring MVC, JaxWS, Axis.",
          "Designed and developed <b>scalable</b>, <b>highly available</b> and <b>multi-threaded</b> applications using <b>Java Concurrency</b>.",
          "Implemented applications using Test Driven Development (<b>TDD</b>) with <b>JUnit</b> and <b>Easy Mock</b>.",
          "Used a number of protocols such as <b>HTTP</b>, <b>TCP</b>, <b>FTP</b>, <b>SMPP</b> and <b>SNMP</b> to develop integrated applications.",
          "Performed <b>load tests</b> using various simulators, revised and fixed performance related issues.",
          "Developed an application to provide <b>Single Sign-On</b> (<b>SSO</b>), authentication and authorisation functionalities.",
          "Implemented a fully configurable client application to provide monitoring capabilities using <b>SNMP</b> protocol.",
          "<b>Other technologies used:</b> Spring Framework, Hibernate, Eclipse, Toad, Jira, Bamboo, Cobertura, CVS, Oracle, PL-SQL, My SQL, HSQL, Tomcat, Jetty, Unix and Solaris."
        ]
      },
      {
        "expanded": false,
        "company": "Millitary Service (KKK)",
        "period": "2004/07 – 2005/03 (9m)",
        "title": "Web Application Developer"
      },
      {
        "expanded": false,
        "company": "Cozum Software Services",
        "period": "2002/08 – 2004/03 (1y 8m)",
        "title": "Application Developer – Part Time"
      },
      {
        "expanded": false,
        "company": "Markum.NET",
        "period": "2001/03 – 2001/10 (8m)",
        "title": "Application Developer – Part Time"
      }
    ]
  },
  "education": {
    "title": "EDUCATION",
    "expanded": true,
    "items": [
      {
        "title": "1998 – 2002",
        "detail": "BSc in Computer Engineering - Istanbul University"
      }
    ]
  },
  "courses": {
    "title": "COURSES",
    "expanded": true,
    "items": [
      {
        "title": "Spring Framework (Certified)",
        "detail": "Mar 2011 (40 Hours) - Spring Framework (at Bilginc)."
      },
      {
        "title": "Web Services (Certified)",
        "detail": "May 2010 (40 Hours) - DW3111 Creating Web Services (at Sun)."
      },
      {
        "title": "Oracle &PL/SQL (Certified)",
        "detail": "Mar 2007 (50 Hours) - SQL Fundamentals, SQL and PL/SQL Fundamentals, Advanced PL/SQL, and SQL Tuning Workshop (at Oracle University)."
      },
      {
        "title": "UML & Use Cases (Certified)",
        "detail": "June 2008 (16 Hours) - Requirement Management with Use Cases (at Bildem)."
      },
      {
        "title": "Project Management (Certified)",
        "detail": "June 2007 (16 Hours) – The Art of Project Management (at Project Management Institute)."
      },
      {
        "title": "Test Driven Development",
        "detail": "Oct 2007 (16 Hours) - Agile Programming and Test Driven Development."
      }
    ]
  }
}